using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Emergence : MonoBehaviour {

    //現在のステージ確認
    public int Stage;

    //ステージ開始からの経過時間(フレーム数)
    int StageTime;
    //ステージが切り替わったら経過時間リセット
    bool ResetTime = false;


    //========================================================
    //
    //  関数はここから
    //
    //========================================================
    //========================================================
    // Use this for initialization
    //========================================================
    void Start () {
		
	}



    //========================================================
    // Update is called once per frame
    //========================================================
    void Update () {

        //=====================================
        //ステージ01の時
        //=====================================
        if(Stage == 1)
        {
            //一定時間経過
            if (StageTime == 60)
            {
                //敵を出撃
                
            }
            //一定時間経過
            if (StageTime == 120)
            {
                //敵を出撃

            }
            //一定時間経過
            if (StageTime == 300)
            {
                //================
                //ステージ01終了
                //================
                //

                //時間リセット
                ResetTime = false;
            }
        }
        //=====================================
        //ステージ02の時
        //=====================================
        if (Stage == 2)
        {
            //ステージの切り替わりに一度経過時間リセット
            if(ResetTime == false)
            {
                StageTime = 0;
                ResetTime = true;
            }

            //一定時間経過
            if (StageTime == 60)
            {
                //敵を出撃

            }
        }



        //経過時間(フレーム数)
        StageTime++;
    }
}
